Revit 2024 API
Category.CategoryType Property
 Gets the category type of this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public CategoryType CategoryType { get; }
Visual Basic
Public ReadOnly Property CategoryType As CategoryType
	Get
Visual C++
public:
property CategoryType CategoryType {
	CategoryType get ();
}
Remarks
 The category type determines if the category is shown in the Visibility/Graphics settings grouped with the model,annotation, or analytical model categories. Note that import categories are also "model" but will be shown separately in the dialog. Some categories not shown in the dialog and will return Internal for the category type.
See Also
Category Class
Autodesk.Revit.DB Namespace